[]
=aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa

[MACROEDIT]
//編程主選單=
lb_GameDirectory_OME->Caption=игра
GameManagement=файл
GameManagement_Select=Выбор
GameManagement_New=Новая игра
GameManagement_Modify=Добавить игру
GameManagement_Delete=Удалить игру
FileManagement=Файл в / вне
FileManagement_New=новый
FileManagement_Open=открыть
FileManagement_Save=сохранить
FileManagement_SaveAs=сохранить как
FileManagement_Delete=удалить
FileManagement_ReName=переименовать
FileManagement_Transfer=Загрузить/Скачать
lb_FileName_OME->Caption=файла
//編程程式區=
rb_Loop_OME->Caption=Увеличить
rb_Keyboard_OME->Caption=Кнопка
rb_If_OME->Caption=Если
rb_Equal_OME->Caption=EQU
lb_SRSectionReteatText1_OME->Caption=Начать
lb_SRSectionReteatText2_OME->Caption=~
lb_SRSectionReteatText3_OME->Caption=Завершить,
lb_SRSectionReteatText4_OME->Caption=Повторить
lb_SR_OME->Caption=~
lb_GotoText_OME->Caption=Пер. к стр
lb_LineText_OME->Caption=
lb_KeyIfText_OME->Caption=Если
lb_KeyStateIsText_OME->Caption=Является
lb_KeyThenGotoText_OME->Caption=Пер. к стр
lb_KeyLineText_OME->Caption=
lb_IfText1_OME->Caption=Если
lb_IfThenGoto1_OME->Caption=Пер. к стр
lb_IfLineText1_OME->Caption=
lb_IfText2_OME->Caption=Если
lb_IfThenGoto2_OME->Caption=Пер. к стр
lb_IfLineText2_OME->Caption=
cb_Key_OME->Items->Strings[0]=Клавиша1
cb_Key_OME->Items->Strings[1]=Клавиша2
cb_Key_OME->Items->Strings[2]=Клавиша3
cb_Key_OME->Items->Strings[3]=Клавиша4
cb_Key_OME->Items->Strings[4]=Клавиша5
cb_Key_OME->Items->Strings[5]=Клавиша6
cb_Key_OME->Items->Strings[6]=Клавиша7
cb_Key_OME->Items->Strings[7]=Клавиша8
cb_Key_OME->Items->Strings[8]=Клавиша9
cb_Key_OME->Items->Strings[9]=Клавиша10
cb_Key_OME->Items->Strings[10]=Клавиша11
cb_Key_OME->Items->Strings[11]=Клавиша12
cb_Key_OME->Items->Strings[12]=Клавиша13
cb_Key_OME->Items->Strings[13]=Клавиша14
cb_Key_OME->Items->Strings[14]=Клавиша15
cb_Key_OME->Items->Strings[15]=Клавиша16
cb_Key_OME->Items->Strings[16]=Клавиша17
cb_Key_OME->Items->Strings[17]=Клавиша18
cb_Key_OME->Items->Strings[18]=Клавиша19
cb_Key_OME->Items->Strings[19]=Клавиша20
cb_Key_OME->Items->Strings[20]=Клавиша21
cb_Key_OME->Items->Strings[21]=Клавиша22
cb_Key_OME->Items->Strings[22]=Клавиша23
cb_Key_OME->Items->Strings[23]=Клавиша24
cb_KeyState_OME->Items->Strings[0]=Нажмите
cb_KeyState_OME->Items->Strings[1]=Отпустите
cb_IfSign1_OME->Items->Strings[0]="@equ@@equ@"
cb_IfSign1_OME->Items->Strings[1]="!@equ@"
cb_IfSign2_OME->Items->Strings[0]="@equ@@equ@"
cb_IfSign2_OME->Items->Strings[1]="!@equ@"
Var->Items->Strings[0]=Variable A
Var->Items->Strings[1]=Variable B
Var->Items->Strings[2]=Variable C
Var->Items->Strings[3]=Variable D
//時間控制區=
lb_KeyDownAutoDelay_OME->Caption=Сделайте задержку при нажатии
lb_KeyUpAutoDelay_OME->Caption=Сделайте задержку при снятии
lb_TimeUnit_OME->Caption=Частица время
cb_TimeType_OME->Items->Strings[0]=Сек
cb_TimeType_OME->Items->Strings[1]=Мсек
cb_TimeType_OME->Items->Strings[2]=Мин
lb_Time_OME->Caption=Время
//滑鼠控制區=
lb_AbsPos_OME->Caption=Абсол. коорд. мыши (X,Y)
lb_AbsPos_OME->Hint=Передвинте курсор на экране, захватив (X,Y) координаты.
lb_RelativePos_OME->Caption=Mouse relative coordinate(X,Y)
bt_WheelUp_OME->Caption=Вперед
bt_WheelDown_OME->Caption=Назад
bt_MouseLeftKey_OME->Caption=Влево
bt_MouseRightKey_OME->Caption=Вправо
bt_MouseMidKey_OME->Caption=Центр
bt_Mouse4thKey_OME->Caption=4ый
bt_Mouse5thKey_OME->Caption=5ый
im_CursorPoint_OME->Hint=Определить X, Y координаты и перенести цель в любую точку экрана.
//編程工具列=
rb_RepeatType_OME->Hint=Нетn-repeat  
rb_RepeatType1_OME->Hint=Нажмите:Начать@RETURN@Отпустите:Остановить
rb_RepeatType2_OME->Hint=Нажмите:Начать@RETURN@Нажмте снова:Остановить
bt_Save_OME->Hint=сохранить
bt_Undo_OME->Hint=отменить
bt_Redo_OME->Hint=повторить
bt_Cut_OME->Hint=вырезать
bt_Copy_OME->Hint=копировать
bt_Paste_OME->Hint=вставить
bt_MoveDown_OME->Hint=переместить вверх
bt_MoveUp_OME->Hint=переместить вниз
bt_Delete_OME->Hint=удалить
bt_Record_OME->Hint=запись
//編程Popup視窗=
mi_Cut_OME->Caption=вырезать
mi_CutSingleLine_OME->Caption=Вырезать строку
mi_CutMultiLine_OME->Caption=Вырезать несколько строк
mi_Copy_OME->Caption=копировать
mi_CopySingleLine_OME->Caption=Скопировать строку
mi_CopyMultiLine_OME->Caption=Скопировать несколько строк
mi_Paste_OME->Caption=вставить
mi_MoveDown_OME->Caption=переместить вверх
mi_MoveUp_OME->Caption=переместить вниз
mi_Editline_OME->Caption=Редактировать 
mi_Delete_OME->Caption=удалить
mi_DeleteSingleLine_OME->Caption=Удалить строку
mi_DeleteMultiLine_OME->Caption=Удалить несколько строк
mi_ClearAllDelay_OME->Caption=очистить все "Пауза"
mi_ClearAll_OME->Caption=очистить все
bt_ResumeMacroII_OME->Caption=Возобновить [ Оскар II]
bt_DownloadExplain_OME->Caption=     Инструкция
GoWhile=Повторять со строки%x до строки, повторять %y раз
IfYes=Если Variable %x @equ@ %y Перепрыгнуть на строчку%z
IfNo=Если Variable %x ≠ %y Перепрыгнуть на строчку%z
IfYes2=Если Variable %x @equ@  Variable %y Перепрыгнуть на строчку%z
IfNo2=Если Variable %x ≠ Variable %y Перепрыгнуть на строчку%z
Equ=Переменная %x @equ@ %y
Equ2=Переменная %x @equ@ Переменная %y
Equ3_0=Переменная %x @equ@ Переменная %y + %z
Equ3_1=Переменная %x @equ@ Переменная %y - %z
Equ3_2=Переменная %x @equ@ Переменная %y & %z
Equ3_3=Переменная %x @equ@ Переменная %y | %z
Equ3_4=Переменная %x @equ@ Переменная %y ^ %z
Goto=Перепрыгнуть на строчку%x
IfKeyDown=Если key %x is pressed,Перепрыгнуть на строчку%y
IfKeyUp=Если key %x is Нетt pressed,Перепрыгнуть на строчку%y
Key=Клавиша
KeyDown=Нажать
KeyUp=Отпустить
MouseMoveTo=Переместить_мышь_на
MouseRelativeMove=Относительное_перемещение_мыши
Delay=Задержка
millisecond=мс
second=сек.
minute=Мин.
MouseWhellUp=прокрутка_вверх
MouseWhellDown=прокрутка_вниз
MouseLeftKeyDown=нажать_левую_кнопку
MouseLeftKeyUp=отпустить_левую_кнопку
MouseLeftKeyClick=клик_левой_кнопкой
MouseLeftKeyDblClick=двойной_клик_левой_кнопкой
MouseMiddleKeyDown=нажать_среднюю_кнопку
MouseMiddleKeyUp=отпустить_среднюю_кнопку
MouseMiddleKeyClick=клик_средней_кнопкой
MouseRightKeyDown=нажать_на_правую_кнопку
MouseRightKeyUp=отпустить_правую_кнопку
MouseRightKeyClick=клик_правой_кнопкой
MouseFourthKeyDown=нажать_4-ую_кнопку
MouseFourthKeyUp=отпустить_4-ую_кнопку
MouseFourthKeyClick=клик_4-ой_кнопкой
MouseFifthKeyDown=нажать_5-ую_кнопку
MouseFifthKeyUp=отпустить_5-ую_кнопку
MouseFifthKeyClick=клик_5-ой_кнопкой
PleaseInputMacroName=ключ к названию макроса
SaveOK=сохранить!
MacroUsed=Файл / Папка была применена к памяти мыши, вы хотите Удалить / Переименовать? Если [Да] функция будет удалять!
GoWhileRangeError=диапазон не действителен
InputDigitError=пожалуйста, введите число
VersionMessage=Версия для чтения, невозможно сохранить!
LoopLimit=Не более 3 раз
NullMacro=Без названия
PleaseCreateDirectory=Пожалуйста, создайте папку с игрой
DirectoryUsed=Файл / Папка была применена к памяти мыши, вы хотите Удалить / Переименовать? Если [Да] функция будет удалять!
TrialAccessDeny=Благодарим за просмотр [HEADSHOT]! Не возможно применить! Пожалуйста приобретите код для активации Ultra-Core3 в нашем интернет-магазине!@RETURN@(ПО Bloody7 применимо исключительно для V и R серий)@RETURN@
IsCoverSameNameFile=Same [Oscar II] file name found, overwrite?

CPIRemarkDefault=По умолчанию
//按鍵測試區=
lb_MouseKeyTest_OME->Caption=Запрос кнопки
PleasePressKey=Нажмите кнопку мыши
MouseKeyUnknown=Не распознано

[MACROEDIT_Record]
bt_Start->Caption=<F11> начать
bt_Stop->Caption=<F12> завершить
cb_AxisAbsolute->Caption=Запись абсолютного движения мыши
cb_AxisRelatively->Caption=Запись относительного движения мыши
cb_KeyboardAction->Caption=Запись работы клавиатуры
cb_MouseClick->Caption=Запись нажатий кнопок мыши
Script3=запись скрипта ниже
Script4=3 метода создания скрипта
Script5=1, включить функции из верхней левой панели
Script6=2, веведите с помощью клавиатуры.
Script7=3, веведите с клавиатуры

[MACROEDIT_Statement]
lb_Title->Caption=ввод перед сохранением
lb_Software->Caption=название программы(например CS)
lb_Statement->Caption=Описание макроса детально
lb_Comment->Caption=Описание функций
mi_EditerCut->Caption=вырезать
mi_EditerCopy->Caption=копировать
mi_EditerPaste->Caption=вставить
lb_EditComment->Caption1=Опишите функции
lb_EditComment->Caption2=Добавить описание функции
lb_Resolution->Caption=Разрешение
lb_CPIRemark->Caption=Чувствительность

[MACROEDIT_Instructions]
lb_TestDescription->Caption=Данные будут временно сохранены на 4-ой кнопке мыши. В тестовой зоне или игровом тесте, для возвращения параметра 5-ой кнопки по умолчанию, перейдите на «Страницу кнопки» и повторно выполните сброс
ck_CursorRecord->Caption=Включение записи курсора
lb_InterruptTips->Caption=В случае, если тестовая программа выходит из под контроля, нажмите [Caps Lock]+[Scroll Lock]+[Num Lock] для ее прерывания, а затем выполните отладку программы повторно.
lb_TestCommon->Caption=Описание макроса детально
PressSpaceToTest=Нажать 4ую кнопку для запуска теста

[MACROEDIT_ShowIfMessage]
MacroExistAlready=Файл уже существует, заменить его?
MacroModify=сценарий изменен, сохранить?
MacroNewCreate=Новый файл?
MacroDeleteFile=Удалить файл?
MacroSelectFile=Файл / Папка была применена к памяти мыши, вы хотите Удалить / Переименовать? Если [Да] функция будет удалять!
MacroDeleteDirectory=Удалить эту игровую папку? Файлы в этой папке также будут удалены.
PleaseCreateDirectory=Новый
InputNameExists=Файл существует, обновить!
MustCreatFile=Вы должны создать новый файл для редактирования макросов!
InputNameInvalid=Знаки [., \ / : * ? " < > | ]. не допустимы.

[MACROEDIT_InputBoxX]
lb_NewFileName->Caption=Имя нового файла
lb_ReName->Caption1=Переименовать 
lb_ReName->Caption2=Создать
lb_ReName->Caption3=Новая папка
NewCreateGameName=Новая папка
NewCreateFileName=Новый файл

[MACROEDIT_Dialog]
lb_Directory->Caption=Содержание
lb_FileName->Caption=файл
lb_Title->Caption1=Новый
lb_Title->Caption2=Открыть
lb_Title->Caption3=Сохранить
lb_Title->Caption4=Сохранить как…
lb_Title->Caption5=Удалить
lb_Title->Caption6=Переименовать
lb_FileType->Caption=Тип
advcb_FileType->Caption1=Все пистолет файл *.*
advcb_FileType->Caption2=*.amc (Macro)
advcb_FileType->Caption3=*.mgn (Macro gun)
NoAuthorityUse=Не достаточно прав, экспорт не удался.

[MACROEDIT_SelectLine]
lb_SelectLineRange->Caption=Выделить диапазон строк

